app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 16 Sep 2013 09:14:18 UTC +00:00], ["text", "This is a first post!"], ["title", "First post"], ["updated_at", Mon, 16 Sep 2013 09:14:18 UTC +00:00]]
---
	def create
		@post = Post.new(post_params)

		if @post.save